; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-6-4)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	p0-3 - location
	p1-3 - location
	p1-8 - location
	p2-3 - location
	p2-7 - location
	p4-0 - location
	p4-3 - location
	p4-6 - location
	p4-9 - location
	p4-10 - location
	p5-4 - location
	p5-9 - location
	p5-10 - location
	p6-1 - location
	p7-3 - location
	p8-2 - location
	p8-7 - location
	p9-2 - location
	p10-3 - location
	p10-9 - location
	)
	(:init
	(at driver1 s7)
	(at driver2 s2)
	(at driver3 s4)
	(at driver4 s9)
	(at driver5 s2)
	(at truck1 s3)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s1)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s2)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s8)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s3)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at truck6 s7)
	(empty truck6)
	(= (load truck6) 0)
	(= (fuel-per-minute truck6) 10)
	(at package1 s8)
	(at package2 s5)
	(at package3 s6)
	(at package4 s6)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s1 p1-8)
	(path p1-8 s1)
	(path s8 p1-8)
	(path p1-8 s8)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-7)
	(path p2-7 s2)
	(path s7 p2-7)
	(path p2-7 s7)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(path s4 p4-9)
	(path p4-9 s4)
	(path s9 p4-9)
	(path p4-9 s9)
	(path s4 p4-10)
	(path p4-10 s4)
	(path s10 p4-10)
	(path p4-10 s10)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(path s5 p5-9)
	(path p5-9 s5)
	(path s9 p5-9)
	(path p5-9 s9)
	(path s5 p5-10)
	(path p5-10 s5)
	(path s10 p5-10)
	(path p5-10 s10)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(path s7 p7-3)
	(path p7-3 s7)
	(path s3 p7-3)
	(path p7-3 s3)
	(path s8 p8-2)
	(path p8-2 s8)
	(path s2 p8-2)
	(path p8-2 s2)
	(path s8 p8-7)
	(path p8-7 s8)
	(path s7 p8-7)
	(path p8-7 s7)
	(path s9 p9-2)
	(path p9-2 s9)
	(path s2 p9-2)
	(path p9-2 s2)
	(path s10 p10-3)
	(path p10-3 s10)
	(path s3 p10-3)
	(path p10-3 s3)
	(path s10 p10-9)
	(path p10-9 s10)
	(path s9 p10-9)
	(path p10-9 s9)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 52)
	(= (time-to-drive s1 s0) 52)
	(link s0 s8)
	(link s8 s0)
	(= (time-to-drive s0 s8) 89)
	(= (time-to-drive s8 s0) 89)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 84)
	(= (time-to-drive s5 s1) 84)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 15)
	(= (time-to-drive s1 s2) 15)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 56)
	(= (time-to-drive s5 s2) 56)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 67)
	(= (time-to-drive s0 s3) 67)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 18)
	(= (time-to-drive s2 s3) 18)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 88)
	(= (time-to-drive s5 s3) 88)
	(link s3 s8)
	(link s8 s3)
	(= (time-to-drive s3 s8) 62)
	(= (time-to-drive s8 s3) 62)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 22)
	(= (time-to-drive s4 s5) 22)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 100)
	(= (time-to-drive s2 s6) 100)
	(link s6 s3)
	(link s3 s6)
	(= (time-to-drive s6 s3) 89)
	(= (time-to-drive s3 s6) 89)
	(link s6 s7)
	(link s7 s6)
	(= (time-to-drive s6 s7) 21)
	(= (time-to-drive s7 s6) 21)
	(link s7 s1)
	(link s1 s7)
	(= (time-to-drive s7 s1) 59)
	(= (time-to-drive s1 s7) 59)
	(link s7 s2)
	(link s2 s7)
	(= (time-to-drive s7 s2) 88)
	(= (time-to-drive s2 s7) 88)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 18)
	(= (time-to-drive s5 s7) 18)
	(link s7 s10)
	(link s10 s7)
	(= (time-to-drive s7 s10) 74)
	(= (time-to-drive s10 s7) 74)
	(link s8 s5)
	(link s5 s8)
	(= (time-to-drive s8 s5) 47)
	(= (time-to-drive s5 s8) 47)
	(link s8 s6)
	(link s6 s8)
	(= (time-to-drive s8 s6) 11)
	(= (time-to-drive s6 s8) 11)
	(link s8 s9)
	(link s9 s8)
	(= (time-to-drive s8 s9) 44)
	(= (time-to-drive s9 s8) 44)
	(link s8 s10)
	(link s10 s8)
	(= (time-to-drive s8 s10) 93)
	(= (time-to-drive s10 s8) 93)
	(link s9 s0)
	(link s0 s9)
	(= (time-to-drive s9 s0) 19)
	(= (time-to-drive s0 s9) 19)
	(link s9 s2)
	(link s2 s9)
	(= (time-to-drive s9 s2) 84)
	(= (time-to-drive s2 s9) 84)
	(link s9 s4)
	(link s4 s9)
	(= (time-to-drive s9 s4) 56)
	(= (time-to-drive s4 s9) 56)
	(link s10 s0)
	(link s0 s10)
	(= (time-to-drive s10 s0) 38)
	(= (time-to-drive s0 s10) 38)
	(link s10 s1)
	(link s1 s10)
	(= (time-to-drive s10 s1) 51)
	(= (time-to-drive s1 s10) 51)
	(link s10 s5)
	(link s5 s10)
	(= (time-to-drive s10 s5) 52)
	(= (time-to-drive s5 s10) 52)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s10)
	(at driver4 s10)
	(at truck1 s10)
	(at truck2 s7)
	(at truck3 s6)
	(at truck4 s10)
	(at truck5 s4)
	(at package1 s3)
	(at package2 s7)
	(at package3 s6)
	(at package4 s9)
	))

(:metric minimize (+ (* 2 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (board-truck driver2 truck3 s2)
   deleted: (at driver2 s2) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 1 of 11
2. (drive-truck truck3 s2 s3 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   changed: (fuel-used) from 0 to 180
   goals met: 1 of 11
3. (walk driver4 s9 p10-9)
   deleted: (at driver4 s9)
   added: (at driver4 p10-9)
   goals met: 1 of 11
4. (disembark-truck driver2 truck3 s3)
   deleted: (driving driver2 truck3)
   added: (at driver2 s3) (empty truck3)
   goals met: 1 of 11
5. (walk driver4 p10-9 s10)
   deleted: (at driver4 p10-9)
   added: (at driver4 s10)
   goals met: 2 of 11
6. (walk driver5 s2 p8-2)
   deleted: (at driver5 s2)
   added: (at driver5 p8-2)
   goals met: 2 of 11
7. (load-truck package1 truck4 s8)
   deleted: (at package1 s8)
   added: (in package1 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 2 of 11
8. (walk driver5 p8-2 s8)
   deleted: (at driver5 p8-2)
   added: (at driver5 s8)
   goals met: 2 of 11
9. (board-truck driver5 truck4 s8)
   deleted: (at driver5 s8) (empty truck4)
   added: (driving driver5 truck4)
   goals met: 2 of 11
10. (drive-truck truck4 s8 s5 driver5)
   deleted: (at truck4 s8)
   added: (at truck4 s5)
   changed: (fuel-used) from 180 to 697
   goals met: 2 of 11
11. (load-truck package2 truck4 s5)
   deleted: (at package2 s5)
   added: (in package2 truck4)
   changed: (load truck4) from 1 to 2, (fuel-per-minute truck4) from 11 to 13
   goals met: 2 of 11
12. (drive-truck truck4 s5 s7 driver5)
   deleted: (at truck4 s5)
   added: (at truck4 s7)
   changed: (fuel-used) from 697 to 931
   goals met: 2 of 11
13. (unload-truck package2 truck4 s7)
   deleted: (in package2 truck4)
   added: (at package2 s7)
   changed: (load truck4) from 2 to 1, (fuel-per-minute truck4) from 13 to 11
   goals met: 3 of 11
14. (drive-truck truck4 s7 s6 driver5)
   deleted: (at truck4 s7)
   added: (at truck4 s6)
   changed: (fuel-used) from 931 to 1162
   goals met: 3 of 11
15. (load-truck package4 truck4 s6)
   deleted: (at package4 s6)
   added: (in package4 truck4)
   changed: (load truck4) from 1 to 2, (fuel-per-minute truck4) from 11 to 13
   goals met: 3 of 11
16. (drive-truck truck4 s6 s8 driver5)
   deleted: (at truck4 s6)
   added: (at truck4 s8)
   changed: (fuel-used) from 1162 to 1305
   goals met: 3 of 11
17. (drive-truck truck4 s8 s9 driver5)
   deleted: (at truck4 s8)
   added: (at truck4 s9)
   changed: (fuel-used) from 1305 to 1877
   goals met: 3 of 11
18. (unload-truck package4 truck4 s9)
   deleted: (in package4 truck4)
   added: (at package4 s9)
   changed: (load truck4) from 2 to 1, (fuel-per-minute truck4) from 13 to 11
   goals met: 4 of 11
19. (drive-truck truck4 s9 s0 driver5)
   deleted: (at truck4 s9)
   added: (at truck4 s0)
   changed: (fuel-used) from 1877 to 2086
   goals met: 4 of 11
20. (drive-truck truck4 s0 s3 driver5)
   deleted: (at truck4 s0)
   added: (at truck4 s3)
   changed: (fuel-used) from 2086 to 2823
   goals met: 4 of 11
21. (disembark-truck driver5 truck4 s3)
   deleted: (driving driver5 truck4)
   added: (at driver5 s3) (empty truck4)
   goals met: 4 of 11
22. (unload-truck package1 truck4 s3)
   deleted: (in package1 truck4)
   added: (at package1 s3)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 5 of 11
23. (board-truck driver2 truck1 s3)
   deleted: (at driver2 s3) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 5 of 11
24. (drive-truck truck1 s3 s8 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s8)
   changed: (fuel-used) from 2823 to 3443
   goals met: 5 of 11
25. (drive-truck truck1 s8 s10 driver2)
   deleted: (at truck1 s8)
   added: (at truck1 s10)
   changed: (fuel-used) from 3443 to 4373
   goals met: 6 of 11
26. (disembark-truck driver2 truck1 s10)
   deleted: (driving driver2 truck1)
   added: (at driver2 s10) (empty truck1)
   goals met: 7 of 11
27. (board-truck driver5 truck5 s3)
   deleted: (at driver5 s3) (empty truck5)
   added: (driving driver5 truck5)
   goals met: 7 of 11
28. (drive-truck truck5 s3 s5 driver5)
   deleted: (at truck5 s3)
   added: (at truck5 s5)
   changed: (fuel-used) from 4373 to 5253
   goals met: 7 of 11
29. (walk driver2 s10 p10-3)
   deleted: (at driver2 s10)
   added: (at driver2 p10-3)
   goals met: 6 of 11
30. (walk driver2 p10-3 s3)
   deleted: (at driver2 p10-3)
   added: (at driver2 s3)
   goals met: 6 of 11
31. (drive-truck truck5 s5 s4 driver5)
   deleted: (at truck5 s5)
   added: (at truck5 s4)
   changed: (fuel-used) from 5253 to 5473
   goals met: 7 of 11
32. (board-truck driver2 truck4 s3)
   deleted: (at driver2 s3) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 7 of 11
33. (drive-truck truck4 s3 s8 driver2)
   deleted: (at truck4 s3)
   added: (at truck4 s8)
   changed: (fuel-used) from 5473 to 6093
   goals met: 7 of 11
34. (drive-truck truck4 s8 s10 driver2)
   deleted: (at truck4 s8)
   added: (at truck4 s10)
   changed: (fuel-used) from 6093 to 7023
   goals met: 8 of 11
35. (walk driver3 s4 p4-3)
   deleted: (at driver3 s4)
   added: (at driver3 p4-3)
   goals met: 8 of 11
36. (disembark-truck driver2 truck4 s10)
   deleted: (driving driver2 truck4)
   added: (at driver2 s10) (empty truck4)
   goals met: 9 of 11
37. (walk driver3 p4-3 s3)
   deleted: (at driver3 p4-3)
   added: (at driver3 s3)
   goals met: 9 of 11
38. (board-truck driver3 truck3 s3)
   deleted: (at driver3 s3) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 9 of 11
39. (drive-truck truck3 s3 s6 driver3)
   deleted: (at truck3 s3)
   added: (at truck3 s6)
   changed: (fuel-used) from 7023 to 7913
   goals met: 10 of 11
40. (disembark-truck driver3 truck3 s6)
   deleted: (driving driver3 truck3)
   added: (at driver3 s6) (empty truck3)
   goals met: 10 of 11
41. (walk driver3 s6 p6-1)
   deleted: (at driver3 s6)
   added: (at driver3 p6-1)
   goals met: 10 of 11
42. (walk driver3 p6-1 s1)
   deleted: (at driver3 p6-1)
   added: (at driver3 s1)
   goals met: 10 of 11
43. (board-truck driver3 truck2 s1)
   deleted: (at driver3 s1) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 10 of 11
44. (drive-truck truck2 s1 s7 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s7)
   changed: (fuel-used) from 7913 to 8503
   goals met: 11 of 11
